In [1]:
s = ""
n = int(input("Enter how many rows = "))
for i in range(n):
    name = input("Enter name = ")
    phone = int(input("Enter pone = "))
    age = int(input("Enter age = "))
    add = input("Enter add = ")
    blood = input("Enter blood group = ")
    
    info = f"{name},{age},{add},{phone},{blood}\n"
    s = s+info
    
b = open('info.csv','w')
b.write(s)
b.close()

Enter how many rows = 6
Enter name = Ram
Enter pone = 9899009988
Enter age = 34
Enter add = Kathmandu
Enter blood group = A+
Enter name = Shyam
Enter pone = 9899887766
Enter age = 34
Enter add = kathmandu
Enter blood group = B+
Enter name = Gita
Enter pone = 9867554565
Enter age = 67
Enter add = Bara
Enter blood group = B+
Enter name = Nabina
Enter pone = 9856554543
Enter age = 34
Enter add = Bhaktapur
Enter blood group = O-
Enter name = Tara
Enter pone = 9867665654
Enter age = 23
Enter add = Pyuthan
Enter blood group = AB+
Enter name = Uttam
Enter pone = 9856776565
Enter age = 23
Enter add = USA
Enter blood group = AB_

In [4]:
import pandas as pd
df = pd.read_csv('info.csv',nrows = 4)
df

     Name  Age    Address       Phone Blood
0     Ram   34  Kathmandu  9899009988    A+
1   Shyam   34  kathmandu  9899887766    B+
2    Gita   67       Bara  9867554565    B+
3  Nabina   34  Bhaktapur  9856554543    O-

In [9]:
import pandas as pd
df = pd.read_csv('info.csv',index_col = 'Name')
# df.head(3)
df.tail(3)

        Age    Address       Phone Blood
Name
Nabina   34  Bhaktapur  9856554543    O-
Tara     23    Pyuthan  9867665654   AB+
Uttam    23        USA  9856776565   AB_

In [11]:
import pandas as pd
df = pd.read_csv('info.csv',index_col = 'Name',usecols = ['Name','Address'])
# df.head(3)
# df.tail(3)

          Address
Name
Nabina  Bhaktapur
Tara      Pyuthan
Uttam         USA